[
    {
        "id": 1,
        "type": "FSD",
        "title": "How much DSA for Full Stack Development Is Required?",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2024/02/feature_image-6-1.webp",
        "description": "Data Structures and Algorithms i.e., DSA for full stack development? It is an unsaid rule to have DSA as a skill to become a full stack developer. Of course for backend development, DSA plays a major role in building a completely functional backend system. But how much? How much DSA is required for full stack development?"
    },
    {
        "id": 2,
        "type": "FSD",
        "title": "Best Books to Learn Full-Stack Development",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/10/Feature-image-Best-Books-to-Learn-Full-Stack-Development-768x480.webp",
        "description": "Are you interested in becoming a full-stack developer but not sure where to start? In this blog, we’ll introduce you to a list of books to learn full-stack development. Full stack development means you can build the whole shebang – from the stuff people see on a website (like buttons and images) to the hidden parts that make everything work (like databases and server programs). In simple terms, it’s about making websites do cool things"
    },
    {
        "id": 3,
        "type": "FSD",
        "title": "7 Best Full-Stack Development Online Courses [2024]",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/08/Feature-image-Best-Full-Stack-Development-Online-Courses-768x480.webp",
        "description": "Today’s world is rapidly evolving into a technological landscape. Owing to these dynamics, the demand and scope for full-stack developers are constantly on the rise. Are you an aspiring web developer striving to enhance your web development skills and become a full-stack web developer?"
    },
    {
        "id": 4,
        "type": "Cyber Security",
        "title": "The Ultimate Cybersecurity Roadmap for Beginners",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2021/03/The-Ultimate-%E2%80%A8Cybersecurity-Roadmap-for-Beginners.webp",
        "description": "Cybersecurity is the practice of protecting systems, networks, and data from malicious attacks and threats. This course will teach you the fundamentals of cybersecurity, including network security, data encryption, identity and access management, and risk management. By the end of the course, you will be able to identify potential threats, implement security measures, and maintain the security of digital assets and networks."
    },
    {
        "id": 5,
        "type": "Cyber Security",
        "title": "Non-Coding Jobs in Cybersecurity: A Comprehensive Guide",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/12/Feature-image-Non-Coding-Jobs-in-Cybersecurity-768x480.webp",
        "description": "In the rapidly evolving field of cybersecurity, there is a common misconception that coding skills are a prerequisite for success. While it is true that certain cybersecurity roles require extensive coding knowledge, there are plenty of non-coding jobs within the industry that play a crucial role in protecting organizations from cyber threats. In this comprehensive guide, we will explore the various non-coding jobs in cybersecurity, the skills required for each role, and how to pursue a career in this exciting field."
    },
    {
        "id": 6,
        "type": "Cyber Security",
        "title": "What Is Hacking? Types of Hacking & More",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/09/Feature-image-What-Is-Hacking_-Types-of-Hacking-More-768x480.webp",
        "description": "Have you ever wondered what hacking is all about? It’s a big deal in today’s tech-heavy world, and it can be both fascinating and scary. In this blog, we’re going to explore hacking in simple terms so that you can understand it better. We’ll look at the different kinds of hacking that exist. "
    },
    {
        "id": 7,
        "type": "Data Science",
        "title": "What is the Difference between Data Science and Data Engineering?",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/10/Feature-image-Difference-between-Data-Science-and-Data-Engineering-768x480.webp",
        "description": "India has been making some serious waves in the world of data. Just like the rest of the world, we’re seeing a massive jump in the demand for data science and data engineering roles. And this isn’t just a passing trend. Companies, big and small, are hungry for data. They want to gather it, crunch it, and use it to supercharge their businesses. And guess where a lot of this action’s happening? Tech hotspots like Bengaluru, Hyderabad, and Pune! But here’s the thing: within this exciting world of data, there are some roles that often get mixed up – like data scientists and data engineers."
    },
    {
        "id": 8,
        "type": "Data Science",
        "title": "Top 10 High Paying Non-Coding Jobs in Data Science in 2024",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/11/Feature-image-Top-High-Paying-Non-Coding-Jobs-in-Data-Science-768x480.webp",
        "description": "Are you someone who’s not interested in coding, but wants to get placed in tech through data science, and earn a handsome salary? Worry Not! Tech companies have various opportunities open for you even if you’ve no experience in coding. Data science has evolved to become one of the most sought-after fields in the tech industry."
    },
    {
        "id": 9,
        "type": "Data Science",
        "title": "Top Product-Based Companies for Data Science Freshers",
        "img": "https://www.guvi.in/blog/wp-content/uploads/2023/11/feature-image-product-based-companies-for-data-science-freshers-768x480.webp",
        "description": "In today’s data-driven world, data science has emerged as a crucial field, with companies harnessing the power of data to gain valuable insights and make informed decisions. "
    }
]